jefferyxm/STM32F4Discovery_CIRRUS43L22/madlld.c
				}
				continue;
			}
			else if(Stream.error==MAD_ERROR_BUFLEN)
                        {
                            continue;
                        }
                        else
                        {
                                Status=1;
                                break;
                        }	
		}

		/* Accounting. The computed frame duration is in the frame
		 * header structure. It is expressed as a fixed point number
		 * whole data type is mad_timer_t. It is different from the
		 * samples fixed point format and unlike it, it can't directly
		 * be added or subtracted. The timer module provides several
		 * functions to operate on such numbers. Be careful there, as
		 * some functions of libmad's timer module receive some of
		 * their mad_timer_t arguments by value!
		 */
		FrameCount++;
		mad_timer_add(&Timer,Frame.header.duration);

		/* Between the frame decoding and samples synthesis we can
		 * perform some operations on the audio data. We do this only
		 * if some processing was required. Detailed explanations are
		 * given in the ApplyFilter() function.
		 */
		//if(DoFilter)
                    //ApplyFilter(&Frame);

		/* Once decoded the frame is synthesized to PCM samples. No errors
		 * are reported by mad_synth_frame();
		 */
		mad_synth_frame(&Synth,&Frame);

		/* Synthesized samples must be converted from libmad's fixed
		 * point number to the consumer format. Here we use unsigned
		 * 16 bit big endian integers on two channels. Integer samples
		 * are temporarily stored in a buffer that is flushed when
		 * full.
		 */
		for(i=0;i<Synth.pcm.length;i++)
		{
			signed short	Sample;

			/* Left channel */
			Sample=MadFixedToSshort(Synth.pcm.samples[0][i]);
//			*(OutputPtr++)=Sample>>8;
//			*(OutputPtr++)=Sample&0xff;
                        *(OutputPtr++)=Sample;

			/* Right channel. If the decoded stream is monophonic then
			 * the right output channel is the same as the left one.
			 */
			if(MAD_NCHANNELS(&Frame.header)==2)
                        {
                            Sample=MadFixedToSshort(Synth.pcm.samples[1][i]);
                        }	
//			*(OutputPtr++)=Sample>>8;
//			*(OutputPtr++)=Sample&0xff;
                        *(OutputPtr++)=Sample;
                        
			/* Flush the output buffer if it is full. */
			if(OutputPtr==OutputBufferEnd)
			{
                            
                            if(startPlay==0)
                            {
                                startDMA();  //开始播放
                                startPlay = 1;
                            }
                          
                            //等待前一个缓冲区数据播放完成
                            if(readyBuffIndex==0)
                            {
                                while(nowUsingBuff1==1);  //buff1 正在使用，需要等待
                            }
                            else if(readyBuffIndex==1)
                            {
                                while(nowUsingBuff0==1);  //buff0 正在使用，需要等待
                            }
  
                            if (++readyBuffIndex>=2)  //切换接收缓冲区
                            {
                                readyBuffIndex=0;
                            }
                            OutputPtr=&OutputBuffer[readyBuffIndex][0];
                            OutputBufferEnd=&OutputBuffer[readyBuffIndex][0]+OUTPUT_BUFFER_SIZE;
			}
		}
	}while(1);

	/* The input file was completely read; the memory allocated by our
	 * reading module must be reclaimed.
	 */
	//BstdFileDestroy(BstdFile);
        
	/* Mad is no longer used, the structures that were initialized must
     * now be cleared.
	 */
        
        stopDMA();
        
        startPlay = 0;
        
	mad_synth_finish(&Synth);
	mad_frame_finish(&Frame);
	mad_stream_finish(&Stream);

	/* If the output buffer is not empty and no error occurred during
         * the last write, then flush it.
	 */
//	if(OutputPtr!=OutputBuffer && Status!=2)
//	{
//		size_t	BufferSize=OutputPtr-OutputBuffer;
//
//                if(f_write(&outFile,OutputBuffer,OUTPUT_BUFFER_SIZE,&writesize) != FR_OK)
//		{
////			fprintf(stderr,"%s: PCM write error (%s).\n",
////					ProgName,strerror(errno));
//			Status=2;
//		}
//	}

	/* Accounting report if no error occurred. */
	if(!Status)
	{
		char	Buffer[80];

		/* The duration timer is converted to a human readable string
		 * with the versatile, but still constrained mad_timer_string()
		 * function, in a fashion not unlike strftime(). The main
		 * difference is that the timer is broken into several
		 * values according some of it's arguments. The units and
		 * fracunits arguments specify the intended conversion to be
		 * executed.
		 *
		 * The conversion unit (MAD_UNIT_MINUTES in our example) also
		 * specify the order and kind of conversion specifications
		 * that can be used in the format string.
		 *
		 * It is best to examine libmad's timer.c source-code for details
		 * of the available units, fraction of units, their meanings,
		 * the format arguments, etc.
		 */
		mad_timer_string(Timer,Buffer,"%lu:%02lu.%03u",
						 MAD_UNITS_MINUTES,MAD_UNITS_MILLISECONDS,0);
		fprintf(stderr,"%s: %lu frames decoded (%s).\n",
				ProgName,FrameCount,Buffer);
	}

	/* That's the end of the world (in the H. G. Wells way). */
	return(Status);
}

/****************************************************************************
 * Prints a message on stderr explaining the usage of the program. Two		*
 * versions of this function are provided, depending on the system type.	*
 ****************************************************************************/
static void PrintUsage(void)
{

}

/****************************************************************************
 * Command-line arguments parsing. We use two methods and two command-line	*
 * formats depending on the system type. On unix system we apply the good	*
 * old getopt() method, other system are offered a really primitive options	*
 * interface.																*
 ****************************************************************************/
static int ParseArgs(int argc, char * const argv[])
{
	
}

/****************************************************************************
 * Program entry point.														*
 ****************************************************************************/
//int main(int argc, char *argv[])
//{
//	char	*cptr;
//	int		Status;
//
//	/* Keep this for error messages. */
//	cptr=strrchr(argv[0],'/');
//	if(cptr==NULL)
//		ProgName=argv[0];
//	else
//		ProgName=cptr+1;
//
//
//	/* Decode stdin to stdout. */
//	Status=MpegAudioDecoder(stdin,stdout);
//	if(Status)
//		fprintf(stderr,"%s: an error occurred during decoding.\n",ProgName);
//
//	/* All done. */
//	return(Status);
//}

/*  LocalWords:  BUFLEN HTAB madlld libmad bstdfile getopt subband ParseArgs JS
 */
/*  LocalWords:  DoFilter subbands errorstr bitrate scalefactor libmad's lu kb
 */
/*  LocalWords:  SWWWFFFFFFFFFFFFFFFFFFFFFFFFFFFF FRACBITS madplay fread synth
 */
/*  LocalWords:  ApplyFilter strftime fracunits atten tSets tRequest tThe tas
 */
/*  LocalWords:  ttransmitted unix todouble tofixed
 */
/*
 * Local Variables:
 * tab-width: 4
 * End:
 */

/****************************************************************************
 * End of file madlld.c														*
 ****************************************************************************/








